[
    { 
        "Company": "CA", 
        "Position": "Intern", 
        "Years": 0, 
        "Months": 3, 
        "ImageLink": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/CA_Technologies_logo.svg/1200px-CA_Technologies_logo.svg.png", 
        "TimeWorked": "June 2013 - August 2013",
        "Notes": [
            "Ran automated test cases and diagnosed issues on various CA Technologies products.",
            "Assisted team with installing software using the UNIX command line.",
            "Ran manual test cases and debugged issues with the workflow.",
            "Created, updated, and ran test cases using HP Quality Center.",
            "Debugged and edited XML scripts for automated test cases."
        ]
    },
    { 
        "Company": "Cigna", 
        "Position": "Intern", 
        "Years": 2, "Months": 0, 
        "ImageLink": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5f/Cigna_logo.svg/1200px-Cigna_logo.svg.png", 
        "TimeWorked": "May 2014 - July 2016", 
        "Notes": [
            "Wrote webpages to allow users to configure reports for underwriting using HTML, Razor, JavaScript and JQuery.",
            "Wrote backend C# and SQL to store report data and generate reports for a user.",
            "Worked with Systems Analysts and other developers to implement business rules.",
            "Created a Proof of Concepts with other interns by working through the innovation process and used an agile development method to create a web application with web technologies, PHP, and MySQL as well as the Java Spring Framework, Angular Javascript, and MongoDB.",
            "Used Agile methodologies to meet business needs and collaborate with other team members",
            "Designed and programmed pages using .NET core and AngularJS that meet business needs"
        ]
    },
    { 
        "Company": "Cigna", 
        "Position": "Junior Application Developer", 
        "Years": 3,
        "Months": 0, 
        "ImageLink": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5f/Cigna_logo.svg/1200px-Cigna_logo.svg.png", 
        "TimeWorked": "July 2016 - March 2019",
        "Notes": [
            "Work with SAFe (Scaled Agile for Enterprise) as an application developer in Sales and Underwriting IT organization"
        ]
    },
    { 
        "Company": "Cigna", 
        "Position": "Senior Application Developer", 
        "Years": 2, 
        "Months": 0, 
        "ImageLink": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5f/Cigna_logo.svg/1200px-Cigna_logo.svg.png", 
        "TimeWorked": "March 2019 - Present",
        "Notes": [
            "Worked as technical lead on various rating tools used by internal business users.",
            "Drive technology innovations and improvements as well as new business functionality for supported tools.",
            "Mentor junior developers and interns on the scrum team to help them learn and understand the business processes.",
            "Design and deliver solutions for complex business problems while working on a scrum team following SAFe processes.",
            "Work with various technologies including C#, Angular, Docker, Kubernetes, and MSSQL."
        ]
    }
]